[
    {
        "Id": "23d3e7f0-2d8f-4fc3-8a3a-8f9b6a6c2e93",
        "Name": "Protein Pancakes",
        "Ingredients": "Oats, banana, protein powder, eggs",
        "Preparation": "In a blender, combine the oats, banana, protein powder, and eggs. Blend until the mixture is smooth and free of lumps. Heat a non-stick pan over medium heat and lightly coat it with cooking spray. Pour a small amount of the batter onto the pan and cook for 2-3 minutes until bubbles appear on the surface. Flip the pancake and cook for an additional 2 minutes on the other side. Serve warm, topped with fresh berries or a drizzle of honey for added flavor.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://www.whollytasteful.com/wp-content/uploads/2022/09/protein-pancakes-with-oats-featured.jpg",
        "CreatedOn": "2024-01-15",
        "Calories": 350,
        "Fats": 8,
        "Carbohydrates": 45,
        "Protein": 25
    },
    {
        "Id": "7fcf8f67-0b44-4be5-9f55-3fd8f0bcb4d1",
        "Name": "Chicken and Rice",
        "Ingredients": "Chicken breast, brown rice, broccoli",
        "Preparation": "Start by seasoning the chicken breast with salt, pepper, and your favorite spices. Heat a grill pan over medium heat and cook the chicken for about 5-6 minutes on each side, or until fully cooked. Meanwhile, bring a pot of water to a boil and add the brown rice, cooking for about 30-35 minutes until tender. Steam the broccoli for 5-7 minutes, until it is bright green and slightly tender. Serve the grilled chicken over the rice with a side of steamed broccoli. Optionally, drizzle with a little olive oil or lemon juice.",
        "Goal": 0,
        "UserID": null,
        "ImageUrl": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/13385.jpg",
        "CreatedOn": "2024-01-16",
        "Calories": 450,
        "Fats": 10,
        "Carbohydrates": 55,
        "Protein": 35
    },
    {
        "Id": "c1d5a8e3-9a7a-4d77-bb38-8aafd82df021",
        "Name": "Mass-Gain Smoothie",
        "Ingredients": "Milk, banana, peanut butter, protein powder, oats, honey",
        "Preparation": "1. Pour 1 cup of milk into a blender. Add a peeled banana, 2 tablespoons of peanut butter, 1 scoop of protein powder, 1/4 cup of oats, and 1 tablespoon of honey. 2. Blend all ingredients on high until the mixture is smooth and creamy, ensuring no chunks remain. 3. Taste and adjust sweetness with more honey if needed. 4. Pour into a large glass and serve chilled. Enjoy immediately for the best texture and flavor.",
        "Goal": 0,
        "UserID": null,
        "ImageUrl": "https://storage.googleapis.com/ayuvya_images/blog_image/5_Best_Smoothie_Recipes_for_Weight_Gain_You_Need_to_Try_Now.webp",
        "CreatedOn": "2024-01-17",
        "Calories": 600,
        "Fats": 20,
        "Carbohydrates": 75,
        "Protein": 30
    },
    {
        "Id": "e3f7d4b7-94b2-4b3f-889e-8d7e5cdef921",
        "Name": "Beef and Sweet Potato Power Bowl",
        "Ingredients": "Ground beef, sweet potato, olive oil, spinach, garlic, salt, pepper",
        "Preparation": "1. Preheat the oven to 400°F (200°C). 2. Peel and cube the sweet potato, then toss with 1 tablespoon of olive oil, salt, and pepper. 3. Spread the cubes on a baking sheet and roast for 20-25 minutes, turning halfway, until tender and golden. 4. While the sweet potato cooks, heat a skillet over medium heat and add 1 tablespoon of olive oil. 5. Add 1 minced garlic clove, cooking until fragrant. Add the ground beef, seasoning with salt and pepper, and cook until browned, breaking it apart as it cooks. 6. Remove the beef from the heat and set aside. 7. In the same pan, lightly sauté a handful of spinach until wilted. 8. In a bowl, layer the roasted sweet potatoes, beef, and spinach, adding more seasoning if desired. Serve warm.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://dianasdelishdishes.com/wp-content/uploads/2023/06/C42B7659-56C9-42D0-BF0E-0A34B78BE0A5.jpeg",
        "CreatedOn": "2024-02-15",
        "Calories": 650,
        "Fats": 28,
        "Carbohydrates": 50,
        "Protein": 40
    },
    {
        "Id": "f3a7d8d2-1b9d-4c31-995a-6fa4fd0b032a",
        "Name": "Chicken Avocado Wrap",
        "Ingredients": "Grilled chicken breast, whole wheat wrap, avocado, tomato, lettuce, Greek yogurt",
        "Preparation": "1. Slice the grilled chicken breast into thin strips. 2. Warm the whole wheat wrap in a dry skillet over medium heat for 1-2 minutes on each side. 3. While the wrap warms, peel and mash 1/2 avocado in a bowl until smooth. 4. Spread a thin layer of Greek yogurt onto the center of the warm wrap. 5. Add the sliced chicken, mashed avocado, tomato slices, and a handful of lettuce. 6. Season with salt and pepper to taste. 7. Fold the bottom of the wrap up, then roll tightly from one side to the other. 8. Cut in half and enjoy immediately.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://tastesbetterfromscratch.com/wp-content/uploads/2014/03/Chicken-Bacon-Avocado-Wrap-1.jpg",
        "CreatedOn": "2024-01-02",
        "Calories": 480,
        "Fats": 15,
        "Carbohydrates": 40,
        "Protein": 30
    },
    {
        "Id": "a6c8d4e0-1c8f-4f1b-b0c2-6a6d9a7a1f2a",
        "Name": "Zucchini Noodles with Grilled Shrimp",
        "Ingredients": "Zucchini, shrimp, garlic, olive oil, cherry tomatoes, parsley, salt, pepper",
        "Preparation": "1. Use a spiralizer to turn 2 zucchinis into noodles. Set aside. 2. Season the shrimp with salt, pepper, and a minced garlic clove. 3. Heat 1 tablespoon of olive oil in a skillet over medium heat, then add the shrimp. Cook for 2-3 minutes per side until pink and opaque. Remove from the skillet and set aside. 4. In the same skillet, add more garlic and sauté until fragrant. 5. Add the zucchini noodles and cherry tomatoes, cooking for 2-3 minutes until slightly softened. 6. Return the shrimp to the skillet, toss with the noodles, and garnish with chopped parsley. Serve warm.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://www.foodiecrush.com/wp-content/uploads/2016/08/Linguine-and-Zucchini-Noodles-with-Shrimp-foodiecrush.com-0014.jpg",
        "CreatedOn": "2024-01-11",
        "Calories": 300,
        "Fats": 10,
        "Carbohydrates": 20,
        "Protein": 25
    },
    {
        "Id": "a7f2e8d4-8b2e-41e8-90d7-5e2e6b7a2f5e",
        "Name": "Egg White Omelet with Spinach",
        "Ingredients": "Egg whites, spinach, bell pepper, olive oil, salt, pepper",
        "Preparation": "1. Whisk together 4 egg whites with a pinch of salt and pepper. 2. Heat 1 teaspoon of olive oil in a non-stick skillet over medium heat. 3. Add a handful of spinach and diced bell pepper to the skillet, cooking until the spinach wilts. 4. Pour the egg whites over the vegetables and cook for 2-3 minutes until the bottom sets. 5. Carefully fold the omelet in half and cook for another minute. 6. Slide the omelet onto a plate and serve immediately.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://images.eatthismuch.com/img/906792_tabitharwheeler_7ecdcbb2-52e2-456d-8c38-4194febe4830.jpg",
        "CreatedOn": "2024-01-12",
        "Calories": 150,
        "Fats": 5,
        "Carbohydrates": 3,
        "Protein": 20
    },
    {
        "Id": "a823fb5b-9ed5-4d90-9c31-2398dcdb78de",
        "Name": "Beef Stir-Fry",
        "Ingredients": "Beef, bell peppers, onions, soy sauce",
        "Preparation": "Slice the beef thinly across the grain and season it with a pinch of salt and pepper. Heat a tablespoon of oil in a large skillet over medium-high heat. Add the beef and cook for 3-4 minutes until browned. Remove the beef and set aside. In the same skillet, add the sliced bell peppers and onions, cooking for about 5 minutes until tender. Add the beef back to the skillet along with soy sauce and a touch of honey or brown sugar for sweetness. Stir everything together and cook for another 2 minutes. Serve hot over rice or noodles.",
        "Goal": 0,
        "UserID": null,
        "ImageUrl": "https://www.rachelcooks.com/wp-content/uploads/2022/09/Beef-Stir-Fry-with-Vegetables016-web-square.jpg",
        "CreatedOn": "2024-01-11",
        "Calories": 500,
        "Fats": 20,
        "Carbohydrates": 30,
        "Protein": 40
    },
    {
        "Id": "b2175cd6-6822-4e93-917f-3e8c70c09fbc",
        "Name": "Greek Yogurt Parfait",
        "Ingredients": "Greek yogurt, berries, honey, granola",
        "Preparation": "In a glass or bowl, start by adding a layer of Greek yogurt at the bottom. Next, add a layer of fresh berries like strawberries, blueberries, or raspberries. Drizzle a teaspoon of honey over the berries to add a touch of sweetness. Add a layer of granola for crunch. Repeat the layers until the glass or bowl is filled, finishing with a few berries and a final drizzle of honey on top. Serve immediately for a refreshing and protein-packed breakfast or snack.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://images.getrecipekit.com/20230919180123-greek-20yogurt-20parfait.png?aspect_ratio=1:1&quality=90&",
        "CreatedOn": "2024-01-11",
        "Calories": 300,
        "Fats": 8,
        "Carbohydrates": 45,
        "Protein": 15
    },
    {
        "Id": "ce451c31-e002-4e97-9140-dc81837b58a7",
        "Name": "Protein Smoothie",
        "Ingredients": "Protein powder, almond milk, banana, spinach",
        "Preparation": "In a blender, add one scoop of protein powder, a cup of almond milk, a ripe banana, and a handful of fresh spinach leaves. Blend on high until the mixture is completely smooth and no chunks remain. Taste the smoothie and add a bit of honey if you want extra sweetness. For a colder smoothie, you can add a few ice cubes or use a frozen banana. Pour into a glass and enjoy immediately for a nutritious breakfast or post-workout snack.",
        "Goal": 0,
        "UserID": null,
        "ImageUrl": "https://assets.tmecosys.com/image/upload/t_web767x639/img/recipe/ras/Assets/1D1F8AE8-0888-45CB-B21B-15377ADC6C9A/Derivates/874a16dd-d1b1-4db0-bc13-fab251938451.jpg",
        "CreatedOn": "2024-01-16",
        "Calories": 250,
        "Fats": 4,
        "Carbohydrates": 30,
        "Protein": 20
    },
    {
        "Id": "37df0c76-9487-4d99-9b18-f5c30c4ffcb3",
        "Name": "Scrambled Eggs with Veggies",
        "Ingredients": "Eggs, salt, bell pepper, spinach",
        "Preparation": "Crack the eggs into a bowl, add a pinch of salt, and whisk until smooth. Heat a small amount of olive oil in a non-stick skillet over medium heat. Add diced bell pepper and cook for 2-3 minutes until softened. Add the spinach and cook until wilted, about 1 minute. Pour the eggs into the pan and gently stir with a spatula, folding the eggs over themselves until just set. Remove from heat while the eggs are still slightly soft. Serve hot, garnished with fresh herbs if desired.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://tealnotes.com/wp-content/uploads/2023/05/Featured-Image-46-800x530.png",
        "CreatedOn": "2024-01-02",
        "Calories": 200,
        "Fats": 15,
        "Carbohydrates": 5,
        "Protein": 12
    },
    {
        "Id": "ab237e7b-08f2-4dcd-b6f9-98a65c96f6ec",
        "Name": "Turkey Lettuce Wraps",
        "Ingredients": "Ground turkey, lettuce, tomatoes, avocado",
        "Preparation": "In a skillet over medium heat, cook the ground turkey until browned, breaking it up with a spoon as it cooks. Season with salt, pepper, and a dash of cumin if desired. Wash and dry large lettuce leaves, which will serve as the wraps. Once the turkey is cooked through, spoon it into each lettuce leaf and top with diced tomatoes and sliced avocado. Serve immediately for a low-carb, high-protein meal.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://tastythin.com/wp-content/uploads/2020/02/asian-turkey-lettuce-wraps2-500x500.jpg",
        "CreatedOn": "2024-02-17",
        "Calories": 300,
        "Fats": 12,
        "Carbohydrates": 10,
        "Protein": 28
    },
    {
        "Id": "ef63dc7f-bb29-4c6c-bcf5-4732ab2f4921",
        "Name": "Grilled Chicken Salad",
        "Ingredients": "Chicken breast, lettuce, cucumber, tomatoes, olive oil",
        "Preparation": "Season the chicken breast with salt, pepper, and a bit of garlic powder. Heat a grill pan over medium heat and cook the chicken breast for 6-7 minutes on each side, until fully cooked. Let the chicken cool slightly, then slice it thinly. In a large bowl, combine chopped lettuce, cucumber, and tomatoes. Drizzle with olive oil and toss to coat. Top with sliced chicken and serve with a light vinaigrette or dressing of your choice.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://www.thespruceeats.com/thmb/1HuTabE4tSdTe8YDcdiR2ts2P3Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/california-grilled-chicken-salad-recipe-334159-13-8ecd934fee5e42f8b5d38239b083460b.jpg",
        "CreatedOn": "2024-03-11",
        "Calories": 350,
        "Fats": 15,
        "Carbohydrates": 12,
        "Protein": 35
    },
    {
        "Id": "e073b44d-417e-4b9e-85d8-5a9536185b68",
        "Name": "Quinoa Bowl",
        "Ingredients": "Quinoa, black beans, corn, avocado, lime",
        "Preparation": "Cook quinoa according to package instructions. In a large bowl, combine cooked quinoa, rinsed black beans, corn, and diced avocado. Squeeze fresh lime juice over the top and toss gently to combine. Season with salt and pepper to taste. For added flavor, you can also add chopped cilantro or diced jalapeño. Serve chilled or at room temperature as a nutritious and filling meal.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://cdn.loveandlemons.com/wp-content/uploads/2023/05/quinoa-bowl-recipe.jpg",
        "CreatedOn": "2024-01-14",
        "Calories": 450,
        "Fats": 15,
        "Carbohydrates": 65,
        "Protein": 15
    },
    {
        "Id": "8e22c1d5-0c6e-47c7-bc25-559518fe4f24",
        "Name": "Tuna Salad",
        "Ingredients": "Canned tuna, mayo, celery, lettuce",
        "Preparation": "In a medium-sized bowl, mix drained canned tuna with a tablespoon of mayo and finely diced celery until well combined. Season the mixture with salt and pepper to taste, adjusting the seasoning as needed. For an added layer of flavor, you might sprinkle in a dash of lemon juice. Once mixed, place a generous scoop of the tuna mixture onto a bed of fresh lettuce leaves on a plate. For extra texture and freshness, you can add diced tomatoes, cucumbers, or even a sprinkle of chopped green onions for a bit of zing. Serve the salad cold, either as a quick, satisfying lunch or a refreshing snack. This salad also pairs well with whole-grain crackers or a slice of toasted bread on the side.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://littlespoonfarm.com/wp-content/uploads/2021/08/tuna-salad-recipe-card.jpg",
        "CreatedOn": "2024-01-01",
        "Calories": 200,
        "Fats": 10,
        "Carbohydrates": 5,
        "Protein": 25
    },
    {
        "Id": "c670818c-d46f-440b-9332-0f0d01937887",
        "Name": "Stuffed Peppers",
        "Ingredients": "Bell peppers, ground beef, rice, cheese",
        "Preparation": "Preheat the oven to 375°F (190°C). Slice the tops off the bell peppers and remove the seeds. In a skillet, brown the ground beef over medium heat. Mix in cooked rice and season with salt, pepper, and Italian herbs. Stuff the mixture into each bell pepper and place them in a baking dish. Top with shredded cheese and bake for about 25-30 minutes until the peppers are tender and the cheese is bubbly.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://mojo.generalmills.com/api/public/content/wD6Zdi1fS0OIerKfD62IBA_webp_base.webp?v=baa249d0&t=191ddcab8d1c415fa10fa00a14351227",
        "CreatedOn": "2024-01-01",
        "Calories": 400,
        "Fats": 18,
        "Carbohydrates": 35,
        "Protein": 25
    },
    {
        "Id": "7a88e34d-b5ba-4717-b1c1-5348d8d2a3ef",
        "Name": "Veggie Omelette",
        "Ingredients": "Eggs, bell peppers, cheese, spinach",
        "Preparation": "Whisk the eggs in a bowl and season with salt and pepper. Heat a non-stick skillet over medium heat and add a little oil. Pour in the eggs and let them cook for about 1-2 minutes until the edges start to set. Add diced bell peppers and cheese on one half of the omelette. Carefully fold the other half over the filling and cook for another minute until the cheese melts and the eggs are fully cooked. Serve hot with a side of toast or fresh fruit.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://heavenlyhomecooking.com/wp-content/uploads/2021/04/Vegetable-Omelette-Recipe-Featured-1.jpg",
        "CreatedOn": "2024-01-01",
        "Calories": 300,
        "Fats": 20,
        "Carbohydrates": 5,
        "Protein": 18
    },
    {
        "Id": "53fa075b-fc37-46bc-b50f-c4d60013ef7a",
        "Name": "Baked Salmon",
        "Ingredients": "Salmon fillet, lemon, herbs, asparagus",
        "Preparation": "Preheat the oven to 400°F (200°C). Place the salmon fillet on a baking sheet lined with parchment paper. Squeeze fresh lemon juice over the top and sprinkle with herbs like dill or parsley. Arrange asparagus around the salmon and drizzle with olive oil. Bake for about 15-20 minutes until the salmon is cooked through and flakes easily with a fork. Serve warm with a side of your choice.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://saltpepperskillet.com/wp-content/uploads/oven-baked-salmon-on-sheet-pan-horizontal-1.jpg",
        "CreatedOn": "2024-01-21",
        "Calories": 400,
        "Fats": 22,
        "Carbohydrates": 8,
        "Protein": 40
    },
    {
        "Id": "eb4ad19e-e048-4630-bb57-2ee9c470de79",
        "Name": "Chickpea Salad",
        "Ingredients": "Chickpeas, cucumber, tomatoes, lemon, olive oil",
        "Preparation": "In a large mixing bowl, combine drained chickpeas, diced cucumber, and chopped tomatoes, making sure the ingredients are evenly distributed. Drizzle the mixture with freshly squeezed lemon juice and a generous splash of olive oil, adjusting both to your taste. Season with salt and pepper, then toss everything thoroughly until well mixed. For the best flavor, allow the salad to marinate in the fridge for at least 30 minutes, letting the chickpeas absorb the lemon and olive oil. This salad can be served immediately, but chilling enhances the flavors, making it a refreshing side dish or light meal.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://cdn.loveandlemons.com/wp-content/uploads/2023/05/chickpea-salad-500x500.jpg",
        "CreatedOn": "2024-01-30",
        "Calories": 250,
        "Fats": 10,
        "Carbohydrates": 30,
        "Protein": 12
    },
    {
        "Id": "fb3e4329-2c05-49cc-9c19-6ff56464918b",
        "Name": "Sweet Potato Fries",
        "Ingredients": "Sweet potatoes, olive oil, salt, pepper",
        "Preparation": "Preheat the oven to 425°F (220°C). Cut the sweet potatoes into thin strips, aiming for even sizes to ensure uniform cooking. Place the cut sweet potatoes in a large bowl, drizzle with olive oil, and season generously with salt and pepper. Toss well, making sure each piece is coated. Spread the sweet potato strips on a baking sheet lined with parchment paper in a single layer to allow proper air circulation for crispiness. Bake for 20-25 minutes, flipping halfway through to ensure even browning. For extra crunch, you can bake a few minutes longer. Serve hot, perfect as a side dish or snack.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://www.kitchensanctuary.com/wp-content/uploads/2021/10/Sweet-Potato-Fries-wideFS-20.webp",
        "CreatedOn": "2024-02-27",
        "Calories": 200,
        "Fats": 8,
        "Carbohydrates": 32,
        "Protein": 3
    },
    {
        "Id": "19bdb4c8-3731-4456-8e8e-5e0d174b3241",
        "Name": "Avocado Toast",
        "Ingredients": "Bread, avocado, salt, pepper, lemon",
        "Preparation": "Toast the bread to your desired level of crispiness in a toaster or oven. Meanwhile, in a bowl, mash the avocado until smooth, seasoning it with a pinch of salt, freshly ground black pepper, and a squeeze of lemon juice for a bit of tanginess. Once the bread is toasted, generously spread the mashed avocado over each slice. For added texture and flavor, you can layer optional toppings such as sliced tomatoes, thinly sliced radishes, or a poached egg on top. Serve immediately to enjoy the fresh flavors.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://www.allrecipes.com/thmb/8NccFzsaq0_OZPDKmf7Yee-aG78=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/AvocadoToastwithEggFranceC4x3-bb87e3bbf1944657b7db35f1383fabdb.jpg",
        "CreatedOn": "2024-04-04",
        "Calories": 350,
        "Fats": 20,
        "Carbohydrates": 30,
        "Protein": 10
    },
    {
        "Id": "fb3e4329-2c05-49cc-9c19-6ff564649118",
        "Name": "Chocolate Chia Pudding",
        "Ingredients": "Chia seeds, almond milk, cocoa powder, honey",
        "Preparation": "In a bowl, mix chia seeds and cocoa powder with almond milk, stirring thoroughly to ensure there are no clumps. Sweeten with honey to taste, adjusting as desired. Cover the bowl and refrigerate for at least 4 hours, preferably overnight, to allow the chia seeds to absorb the liquid and form a pudding-like consistency. Before serving, stir once more to ensure even texture, then top with fresh fruit, nuts, or shredded coconut for added flavor and crunch. Serve chilled for a refreshing, nutritious dessert.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://simple-veganista.com/wp-content/uploads/2017/04/chocolate-chia-pudding-1.jpg",
        "CreatedOn": "2024-11-02",
        "Calories": 200,
        "Fats": 10,
        "Carbohydrates": 25,
        "Protein": 5
    },
    {
        "Id": "29b2d59e-5ac9-46cd-bbb3-4b235e5bff0f",
        "Name": "Coconut Curry Lentil Soup",
        "Ingredients": "Lentils, coconut milk, curry powder, vegetables",
        "Preparation": "In a large pot, heat a drizzle of oil over medium heat, then add your choice of chopped vegetables (such as onions, carrots, and bell peppers). Sauté until the vegetables are softened and fragrant. Stir in the lentils, making sure they are well mixed with the vegetables. Pour in the coconut milk, curry powder, and enough water or vegetable broth to cover the ingredients, then bring the mixture to a gentle boil. Once boiling, reduce the heat to a simmer and cook for 20-25 minutes, stirring occasionally, until the lentils are tender and the soup has thickened. Season with salt and pepper to taste, and garnish with fresh cilantro or lime juice before serving for extra flavor.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://assets.bonappetit.com/photos/5a05c9df3388d32a6ed54e97/1:1/w_2560%2Cc_limit/curried-lentil-tomato-and-coconut-soup.jpg",
        "CreatedOn": "2024-11-04",
        "Calories": 300,
        "Fats": 10,
        "Carbohydrates": 40,
        "Protein": 15
    },
    {
        "Id": "3f9f14b8-bba3-4f57-b407-d4eb33c1f789",
        "Name": "Zucchini Noodles with Pesto",
        "Ingredients": "Zucchini, pesto, cherry tomatoes, olive oil",
        "Preparation": "Using a spiralizer or a julienne peeler, prepare the zucchini noodles and set them aside. Heat a drizzle of olive oil in a large skillet over medium heat, then add the zucchini noodles. Sauté them for about 2-3 minutes, stirring gently to ensure even cooking, until they are slightly softened but still retain a bit of crunch. Add the pesto sauce and toss to coat the noodles thoroughly. Next, add halved cherry tomatoes and cook for an additional 2 minutes, allowing the tomatoes to warm through. Serve immediately, optionally garnishing with grated Parmesan or fresh basil for added flavor.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://www.sweetashoney.co/wp-content/uploads/Zucchini-Noodles-With-Pesto-2-1.jpg",
        "CreatedOn": "2024-11-10",
        "Calories": 200,
        "Fats": 15,
        "Carbohydrates": 10,
        "Protein": 5
    },
    {
        "Id": "a0e4a4a4-4b43-48b7-9173-f84a3f1d52a1",
        "Name": "Spaghetti Aglio e Olio",
        "Ingredients": "Spaghetti, garlic, olive oil, red pepper flakes",
        "Preparation": "Cook the spaghetti according to the package instructions, making sure it is al dente. While the spaghetti cooks, heat a generous amount of olive oil in a large skillet over medium heat. Add thinly sliced garlic and sauté gently, stirring frequently to avoid burning, until the garlic is golden brown and fragrant. Stir in the red pepper flakes to infuse the oil with a bit of heat. Drain the cooked spaghetti and add it directly to the skillet. Toss everything together until the spaghetti is evenly coated in the garlic-infused oil. Serve immediately, garnished with fresh parsley and grated Parmesan, if desired.",
        "Goal": 0,
        "UserID": null,
        "ImageUrl": "https://www.simplyrecipes.com/thmb/gjS-FSuYnqK3fclkE2fWhYl1VWQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Spaghetti-Aglio-e-Olio-LEAD-2-c8e7e8c6edb04a8691463c6ea8cd4ba1.jpg",
        "CreatedOn": "2024-12-02",
        "Calories": 400,
        "Fats": 18,
        "Carbohydrates": 52,
        "Protein": 12
    },
    {
        "Id": "71c3c77c-e826-47c5-92d0-88c42d22b867",
        "Name": "Shrimp Tacos",
        "Ingredients": "Shrimp, corn tortillas, cabbage, lime",
        "Preparation": "Begin by seasoning the shrimp with a pinch of salt and pepper, ensuring they are evenly coated. In a skillet over medium heat, add a small amount of oil and cook the shrimp until they are opaque and pink, about 2-3 minutes per side. In a separate pan, warm the corn tortillas until they are pliable and lightly toasted. To assemble the tacos, place a few shrimp on each tortilla, add a generous handful of shredded cabbage for crunch, and finish with a squeeze of fresh lime juice. Serve immediately, optionally topping with sliced avocado, salsa, or chopped cilantro for additional flavor.",
        "Goal": 0,
        "UserID": null,
        "ImageUrl": "https://www.nutritiousdeliciousness.com/wp-content/uploads/2024/02/Asian-Shrimp-Tacos1.jpg",
        "CreatedOn": "2024-11-06",
        "Calories": 300,
        "Fats": 12,
        "Carbohydrates": 30,
        "Protein": 25
    },
    {
        "Id": "60e4a005-500e-4973-9d71-1b5c462f7de5",
        "Name": "Egg and Spinach Breakfast Wrap",
        "Ingredients": "Eggs, spinach, whole wheat wrap, cheese",
        "Preparation": "Begin by whisking the eggs in a bowl until the yolks and whites are fully blended. In a skillet, heat a little oil or butter over medium heat, then add the spinach. Cook, stirring occasionally, until the spinach is wilted and softened, about 2-3 minutes. Pour the beaten eggs into the skillet with the spinach, and cook gently, stirring occasionally to scramble, until the eggs are fully cooked but still soft. Once the egg and spinach mixture is ready, remove from heat. Place a whole wheat wrap on a flat surface, and spoon the egg and spinach mixture onto the center. Sprinkle with cheese of your choice, such as cheddar or feta. Carefully fold the sides of the wrap over the filling and roll it tightly to form a wrap. Serve warm, perfect for a nutritious breakfast on the go.",
        "Goal": 0,
        "UserID": null,
        "ImageUrl": "https://onebalancedlife.com/wp-content/uploads/2020/08/Breakfast-Wrap-scaled-720x720.jpg",
        "CreatedOn": "2024-11-03",
        "Calories": 350,
        "Fats": 15,
        "Carbohydrates": 30,
        "Protein": 25
    },
    {
        "Id": "dd638b57-0b70-46a7-8aeb-bf8c8025c222",
        "Name": "Chili Con Carne",
        "Ingredients": "Ground beef, kidney beans, tomatoes, chili powder",
        "Preparation": "In a large pot, heat a bit of oil over medium heat and add the ground beef. Cook, stirring frequently to break up any large pieces, until the beef is browned and no longer pink. Once browned, add diced tomatoes, kidney beans (drained and rinsed if canned), and chili powder. Stir everything together and bring to a simmer. Lower the heat and let it cook for about 30 minutes, stirring occasionally to prevent sticking. Adjust seasonings to taste, adding salt, pepper, or more chili powder for heat. Serve hot, garnished with chopped cilantro, shredded cheese, or a dollop of sour cream for extra flavor.",
        "Goal": 0,
        "UserID": null,
        "ImageUrl": "https://img.chefkoch-cdn.de/rezepte/1578671265353584/bilder/1509269/crop-960x540/chili-con-carne.jpg",
        "Calories": 450,
        "Fats": 25,
        "Carbohydrates": 30,
        "Protein": 30
    },
    {
        "Id": "90f40e3b-b5eb-4899-b365-d4a2f94f1281",
        "Name": "Cauliflower Fried Rice",
        "Ingredients": "Cauliflower, peas, carrots, soy sauce",
        "Preparation": "Begin by grating or processing the cauliflower until it resembles rice-sized pieces. In a large skillet, heat a bit of oil over medium heat, then add the peas and diced carrots. Sauté the vegetables for several minutes until they are tender. Add the cauliflower 'rice' and pour in a splash of soy sauce. Stir well to coat all of the cauliflower evenly with the sauce. Continue to cook, stirring frequently, for 5-7 minutes or until the cauliflower is tender but not mushy. Adjust seasoning if needed and serve hot as a side or main dish.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://www.kitchensanctuary.com/wp-content/uploads/2020/09/Cauliflower-Egg-Fried-Rice-square-FS-14.jpg",
        "CreatedOn": "2024-11-03",
        "Calories": 200,
        "Fats": 8,
        "Carbohydrates": 15,
        "Protein": 5
    },
    {
        "Id": "af3f84d1-9f18-4c65-bb8c-04d15c9e2294",
        "Name": "Black Bean Tacos",
        "Ingredients": "Black beans, corn tortillas, avocado, salsa",
        "Preparation": "In a mixing bowl, mash the black beans lightly with a fork or potato masher, then season with a squeeze of fresh lime juice and a pinch of salt and pepper. Warm the corn tortillas in a dry skillet over medium heat for a few minutes on each side until soft and pliable. To assemble the tacos, spread a spoonful of the black bean mixture onto each tortilla, top with diced avocado, and add a generous spoonful of salsa. Serve immediately, garnished with lime wedges for squeezing over the tacos for added flavor.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://www.nospoonnecessary.com/wp-content/uploads/2020/03/Beans-for-Tacos-recipe.jpg",
        "CreatedOn": "2024-12-05",
        "Calories": 250,
        "Fats": 10,
        "Carbohydrates": 35,
        "Protein": 10
    },
    {
        "Id": "be29b72f-3f75-49d0-bb69-7d1e54aab95a",
        "Name": "Quinoa Salad",
        "Ingredients": "Quinoa, cherry tomatoes, cucumber, feta cheese",
        "Preparation": "Cook the quinoa according to the package instructions, then let it cool to room temperature. In a large bowl, combine the cooked quinoa with halved cherry tomatoes, diced cucumber, and crumbled feta cheese. Drizzle with olive oil and a squeeze of fresh lemon juice, and season with salt and pepper to taste. Toss everything together gently to ensure the ingredients are evenly mixed. Serve chilled or at room temperature, optionally garnished with fresh herbs like parsley or mint for added freshness.",
        "Goal": 1,
        "UserID": null,
        "ImageUrl": "https://cdn.apartmenttherapy.info/image/upload/f_jpg,q_auto:eco,c_fill,g_auto,w_1500,ar_4:3/k%2FPhoto%2FRecipes%2F2019-11-recipe-mediterranean-quinoa-salad%2F2019-10-21_Kitchn89095_Mediteranean-Quinoa-Salad",
        "CreatedOn": "2024-12-05",
        "Calories": 400,
        "Fats": 15,
        "Carbohydrates": 50,
        "Protein": 12
    },
    {
        "Id": "a1c1a9cd-25f5-4c19-89f6-32851f0d1152",
        "Name": "Chicken Stir-Fry",
        "Ingredients": "Chicken breast, mixed vegetables, soy sauce, ginger",
        "Preparation": "In a large skillet or wok, heat a bit of oil over medium-high heat. Add diced chicken breast and cook, stirring frequently, until the pieces are golden brown and cooked through. Next, add mixed vegetables (such as bell peppers, broccoli, and snap peas) along with a sprinkle of freshly grated ginger. Stir-fry the mixture for 5-7 minutes, stirring constantly, until the vegetables are tender-crisp. Add a splash of soy sauce and toss to coat everything evenly, cooking for another 2 minutes. Serve hot over rice or noodles for a complete meal.",
        "Goal": 0,
        "UserID": null,
        "ImageUrl": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2021/05/Chicken-Stir-Fry-main-1.jpg",
        "CreatedOn": "2024-02-05",
        "Calories": 350,
        "Fats": 10,
        "Carbohydrates": 20,
        "Protein": 30
    },
    {
        "Id": "d2155f29-4a5a-4e71-a1ef-cb493b45bc4d",
        "Name": "Mediterranean Chickpea Bowl",
        "Ingredients": "Chickpeas, brown rice, cucumber, tahini",
        "Preparation": "Begin by cooking the brown rice according to the package instructions, then let it cool slightly. In a large bowl, combine the cooked rice with chickpeas (drained and rinsed if canned) and diced cucumber. Drizzle with a generous amount of tahini, and season with salt and pepper to taste. Squeeze fresh lemon juice over the bowl and garnish with freshly chopped parsley for added flavor. Serve immediately or refrigerate for a chilled version of this Mediterranean-inspired dish.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://thestayathomechef.com/wp-content/uploads/2021/01/Mediterranean-Chickpea-Salad-1-1200x720.jpg",
        "CreatedOn": "2024-05-01",
        "Calories": 500,
        "Fats": 15,
        "Carbohydrates": 70,
        "Protein": 20
    },
    {
        "Id": "816b8eec-5ff7-408e-a903-55f509b97302",
        "Name": "Baked Salmon with Asparagus",
        "Ingredients": "Salmon fillet, asparagus, olive oil, lemon",
        "Preparation": "Preheat the oven to 400°F (200°C). Arrange the salmon fillets and trimmed asparagus spears on a baking sheet lined with parchment paper. Drizzle with olive oil and squeeze fresh lemon juice over the salmon and asparagus. Sprinkle with salt and pepper to taste. Place the baking sheet in the oven and bake for 15-20 minutes, or until the salmon is cooked through and flakes easily with a fork, and the asparagus is tender-crisp. Serve hot with additional lemon wedges if desired.",
        "Goal": 2,
        "UserID": null,
        "ImageUrl": "https://www.lecremedelacrumb.com/wp-content/uploads/2019/04/sheet-pan-salmon-potatoes-asparagus-1-3.jpg",
        "CreatedOn": "2024-12-10",
        "Calories": 450,
        "Fats": 25,
        "Carbohydrates": 10,
        "Protein": 40
    },
    {
        "Id": "2995c236-5b5d-42f9-89b5-15576256ee66",
        "Name": "Stuffed Bell Peppers",
        "Ingredients": "Bell peppers, ground turkey, quinoa, cheese",
        "Preparation": "Preheat the oven to 375°F (190°C). Prepare the bell peppers by cutting off the tops and removing the seeds and membranes. In a mixing bowl, combine cooked quinoa, browned ground turkey, and shredded cheese. Season the mixture with salt and pepper to taste. Stuff each bell pepper with the quinoa and turkey mixture, packing it tightly. Arrange the stuffed peppers upright in a baking dish, cover the dish with foil, and bake for 30 minutes. Remove the foil and bake for an additional 10 minutes until the peppers are tender and the cheese is melted and golden. Serve hot.",
        "Goal": 0,
        "UserID": null,
        "ImageUrl": "https://thebeanbites.com/wp-content/uploads/2020/03/Instant-Pot-Stuffed-Peppers-10-720x540.jpg",
        "CreatedOn": "2024-12-03",
        "Calories": 350,
        "Fats": 15,
        "Carbohydrates": 30,
        "Protein": 25
    }

]
